tutorials/fsi/cylinderFlap_FSI3/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    // Block 0
    (0 0 0) // vertex 0
    (0.119526 0 0)
    (0.119526 0.119526 0)
    (0 0.119526 0) // vertex 3
    
    (0 0 1) // vertex 4
    (0.119526 0 1)
    (0.119526 0.119526 1)
    (0 0.119526 1) // vertex 7
    
    // Block 1
    (0.280474 0 0) // vertex 8
    (0.280474 0.119526 0)
    
    (0.280474 0 1) // vertex 10
    (0.280474 0.119526 1)
    
    // Block 2
    (0.6 0 0) // vertex 12
    (0.6 0.119526 0)
    
    (0.6 0 1) // vertex 14
    (0.6 0.119526 1)
    
    // Block 3
    (2.5 0 0) // vertex 16
    (2.5 0.119526 0)
    
    (2.5 0 1) // vertex 18
    (2.5 0.119526 1)
    
    // Block 4
    (0.119526 0.280474 0) // vertex 20
    (0 0.280474 0)
    
    (0.119526 0.280474 1) // vertex 22
    (0 0.280474 1)
    
    // Block 5
    (0.164645 0.164645 0) // vertex 24
    (0.164656 0.235355 0)
    
    (0.164645 0.164645 1) // vertex 26
    (0.164656 0.235355 1)
    
    // Block 6
    (0.231623 0.16127 0) // vertex 28
    (0.231623 0.16127 1)
    
    // Block 7
    (0.299528 0.19 0) // vertex 30
    (0.24899 0.19 0)
    
    (0.299528 0.19 1) // vertex 32
    (0.24899 0.19 1)
    
     // Block 8
    (0.6 0.19 0) // vertex 34
    (0.6 0.19 1)
    
    // Block 9
    (2.5 0.19 0) // vertex 36
    (2.5 0.19 1)
    
    // Block 10
    (0.280474 0.280474 0) // vertex 38
    (0.231623 0.238730 0)
    
    (0.280474 0.280474 1) // vertex 40
    (0.231623 0.238730 1)
    
    // Block 11
    (0.299528 0.21 0) // vertex 42
    (0.24899 0.21 0)
    
    (0.299528 0.21 1) // vertex 44
    (0.24899 0.21 1)
    
    // Block 12
    (0.6 0.21 0) // vertex 46
    (0.6 0.280474 0) 
    
    (0.6 0.21 1) // vertex 48
    (0.6 0.280474 1)
    
    // Block 14
    (2.5 0.21 0) // vertex 50
    (2.5 0.280474 0)
    
    (2.5 0.21 1) // vertex 52
    (2.5 0.280474 1)
    
    // Block 15
    (0.119526 0.41 0) // vertex 54
    (0 0.41 0)
    
    (0.119526 0.41 1) // vertex 56
    (0 0.41 1)
    
    // Block 16
    (0.280474 0.41 0) // vertex 58
    (0.280474 0.41 1)
    
    // Block 17
    (0.6 0.41 0) // vertex 60
    (0.6 0.41 1)
    
    // Block 18
    (2.5 0.41 0) // vertex 62
    (2.5 0.41 1)
);

blocks
(
    // Block 0 - 4
    hex ( 0  1  2  3  4  5  6  7) (12 12 1) simpleGrading (1 1 1)
    hex ( 1  8  9  2  5 10 11  6) (15 12 1) simpleGrading (1 1 1)
    hex ( 8 12 13  9 10 14 15 11) (30 12 1) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15) (75 12 1) simpleGrading (5 1 1)
    hex ( 3  2 20 21  7  6 22 23) (12 15 1) simpleGrading (1 1 1)
    
    // Block 5 - 9
    hex (24 25 20  2 26 27 22  6) (15 11 1) simpleGrading (1 5 1)
    hex (28 24  2  9 29 26  6 11) (15 11 1) simpleGrading (1 5 1)
    hex (31 28  9 30 33 29 11 32) (8 11 1) simpleGrading (1 5 1)
    hex ( 9 13 34 30 11 15 35 32) (30 8 1) simpleGrading (1 1 1)
    hex (13 17 36 34 15 19 37 35) (75 8 1) simpleGrading (5 1 1)
    
    // Block 10 - 14
    hex (25 39 38 20 27 41 40 22) (15 11 1) simpleGrading (1 5 1)
    hex (39 43 42 38 41 45 44 40) (8 11 1) simpleGrading (1 5 1)
    hex (42 46 47 38 44 48 49 40) (30 8 1) simpleGrading (1 1 1)
    hex (34 36 50 46 35 37 52 48) (75 2 1) simpleGrading (5 1 1)
    hex (46 50 51 47 48 52 53 49) (75 8 1) simpleGrading (5 1 1)
    
    // Block 15 - 18
    hex (21 20 54 55 23 22 56 57) (12 13 1) simpleGrading (1 1 1)
    hex (20 38 58 54 22 40 59 56) (15 13 1) simpleGrading (1 1 1)
    hex (38 47 60 58 40 49 61 59) (30 13 1) simpleGrading (1 1 1)
    hex (47 51 62 60 49 53 63 61) (75 13 1) simpleGrading (5 1 1)
);

edges
(
    arc 9 2 (0.2 0.1 0) // Block 1
    arc 11 6 (0.2 0.1 1)
    
    arc 2 20 (0.1 0.2 0) // Block 4
    arc 6 22 (0.1 0.2 1)
    
    arc 24 25 (0.15 0.2 0) // Block 5
    arc 26 27 (0.15 0.2 1)
    
    arc 24 28 (0.2 0.15 0) // Block 6
    arc 26 29 (0.2 0.15 1)
    
    arc 9 30 (0.293144 0.156475 0) // Block 7
    arc 28 31 (0.243369 0.175117 0)
    arc 11 32 (0.293144 0.156475 1) // Block 7
    arc 29 33 (0.243369 0.175117 1)
    
    arc 20 38 (0.2 0.3 0) // Block 10
    arc 25 39 (0.2 0.25 0)
    arc 22 40 (0.2 0.3 1) // Block 10
    arc 27 41 (0.2 0.25 1)
    
    arc 39 43 (0.24092 0.228733 0) // Block 11
    arc 41 45 (0.24092 0.228733 1)
    arc 38 42 (0.291756 0.248208 0) // Block 11
    arc 40 44 (0.291756 0.248208 1)
);

patches
(
    patch inlet
    (
        ( 0  4  7  3)
        ( 3  7 23 21)
        (21 23 57 55)
    )
    
    patch outlet
    (
        (16 18 19 17)
        (17 19 37 36)
        (36 37 52 50)
        (50 52 53 51)
        (51 53 63 62)
    )
    
    wall top
    (
        (55 54 56 57)
        (54 58 59 56)
        (58 60 61 59)
        (60 62 63 61)
    )
    
    wall bottom
    (
        (0 1 5 4)
        (1 8 10 5)
        (8 12 14 10)
        (12 16 18 14)
    )
    
    wall plate
    (
        (31 30 32 33)
        (30 34 35 32)
        (34 35 48 46)
        (42 46 48 44)
        (43 42 44 45)
    )
    
    wall cylinder
    (
        (24 28 29 26)
        (28 31 33 29)
        (43 39 41 45)
        (39 25 27 41)
        (25 24 26 27)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
