tutorials/fsi/cylinderFlap_FSI3/fluid/constant/couplingProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object couplingProperties;
}

movingSolidPatches (plate);

movingFluidPatches (plate);
