tutorials/fsi/cylinderFlap_FSI3/fluid/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object fvSolution;
}

solvers
{
  Up
  {
      solver BiCGStab;
      preconditioner Cholesky;

      tolerance 1e-10;
      relTol 1.0e-3;

      minIter 1;
      maxIter 500;
  }

  p
  {
    solver           PCG;
    preconditioner   DIC;
    tolerance        1e-09;
    relTol           1.0e-3;
  }

  U
  {
    solver BiCGStab;
    preconditioner DILU;
    tolerance 1e-10;
    relTol 1.0e-3;
  }
}

blockSolver
{
    pRefCell 0;
    pRefValue 0;
    nOuterCorrectors 500;
    convergenceTolerance 1e-5;
}


PIMPLE
{
  nOuterCorrectors 100;
  nCorrectors 5;
  nNonOrthogonalCorrectors 0;
  convergenceTolerance 1e-5;
}

relaxationFactors
{
  U 0.9;
}
